# Ex 2.2 *read_excel()*    

- [**In Class**: Shoes - Small Data worksheet](#In-Class:-Shoes:-Small-Data-worksheet)  


- [**Exercise**](#Exercise) 
  - [Part 1: Shoes  - Large Data worksheet](#Part-1:-Shoes---Large-Data-worksheet)    
  - [Part 2: w3schools - Orders worksheet](#Part-2:-w3schools---Orders-worksheet)    
  - [Part 3: w3schools - OrderDetails worksheet](#Part-3:-w3schools---OrderDetails-worksheet) 
  - [Part 4: w3schools - Employees worksheet](#Part-4:-w3schools---Employees-worksheet)

In [1]:
import pandas as pd

# In Class: Shoes: *Small Data* worksheet   

- Data file type:  *Excel file*
- Data file:  **Shoes_SmallDataset.xlsx**    
- Worksheet name: **Small Data**
- Name the dataframe:  **df_shoe_store**  


- Display the top rows of the dataframe  
- Display the number of rows and columns of data in the dataframe
- Show the data types of the columns in the dataframe

### 1. Read the Excel Worksheet data into a pandas dataframe

In [2]:
#Name and read the dataframe
df_shoe_store = pd.read_excel("Data/Shoes_SmallDataset.xlsx", "Small Data")

### 2. Display info about the new pandas dataframe

In [3]:
#Display the top rows of the dataframe
df_shoe_store.head()

   OrderID Order Date Product  Size (US) Colour  Price ($)
0       10 2015-01-04   Boots         12  Black         25
1        7 2015-01-03   Boots         10  Black         25
2        8 2015-01-03   Boots          9  Black         25
3       11 2015-01-05   Boots          7  Black         25
4        2 2015-01-02   Boots          4  Black         25

In [4]:
#Display the number of rows and columns in the dataframe
print("The Number of Rows: " , df_shoe_store.shape[0])
print("The Number of Columns: ", df_shoe_store.shape[1])

The Number of Rows:  12
The Number of Columns:  6

In [5]:
#Show the datatypes of the columns in the dataframe
df_shoe_store.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
dtype: object

# Exercise

# Part 1: Shoes - *Large Data* worksheet 
- Data file type:  *Excel file*
- Data file:  **Shoes_SmallDataset.xlsx**    
- Worksheet name: **Large Data**
- Name the dataframe:  **df_shoes_large**  


- Display the top rows of the dataframe  
- Display the number of rows and columns of data in the dataframe
- Show the data types of the columns in the dataframe

In [6]:
#Read the Excel file into a dataframd and display the top rows of the dataframe

df_shoes_large = pd.read_excel("Data/Shoes_SmallDataSet.xlsx", "Large Data")

df_shoes_large.head()

,OrderID,Order Date,Product,Size (US),Colour,Price ($),Store,Returned,Gender
0,1,2015-01-02,Boots,7,Gold,25,California,Yes,Female
1,2,2015-01-02,Boots,4,Black,25,New York,NaN,Female
2,3,2015-01-02,Boots,6,Red,25,Georgia,NaN,Female
3,4,2015-01-03,House Slippers,11,Black,8,Internet,NaN,Female
4,5,2015-01-03,Boots,6,Silver,25,California,NaN,Female

In [7]:
#Dislay the number of rows and columns in the dataframe
print("The Number of Rows: " , df_shoes_large.shape[0])
print("The Number of Columns: ", df_shoes_large.shape[1])p

The Number of Rows:  1000
The Number of Columns:  9

In [8]:
#Show the datatypes of the columns in the dataframe
df_shoes_large.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
Store                 object
Returned              object
Gender                object
dtype: object

# Part 2: w3schools - Orders worksheet
- Excel Filename:  **w3schools_Data.xlsx** 
- Worksheet: **Orders**  
- pandas Dataframe name: **df_w3_orders** 


- Display the first five rows of the dataframe  
- Display the number of rows and columns of data in the dataframe
- Show the data types of the columns in the dataframe

In [9]:
#Read the Excel file into a dataframd and display the top rows of the dataframe

df_w3_orders = pd.read_excel("Data/w3schools_Data.xlsx", "Orders")

df_w3_orders.head()

   OrderID  CustomerID  EmployeeID  OrderDate  ShipperID
0    10248          90           5      35250          3
1    10249          81           6      35251          1
2    10250          34           4      35254          2
3    10251          84           3      35254          1
4    10252          76           4      35255          2

In [11]:
#Dislay the number of rows and columns in the dataframe
print("The Number of Rows: ", df_w3_orders.shape[0])
print("The Number of Columns: ", df_w3_orders.shape[1])

The Number of Rows:  196
The Number of Columns:  5

In [12]:
#Show the datatypes of the columns in the dataframe
df_w3_orders.dtypes

OrderID       int64
CustomerID    int64
EmployeeID    int64
OrderDate     int64
ShipperID     int64
dtype: object

# Part 3: w3schools - OrderDetails worksheet
- Excel Filename:  **w3schools_Data.xlsx** 
- Worksheet: **OrderDetails**  
- pandas Dataframe name: **df_order_details** 


- Display the top rows of the dataframe   
- Display the number of rows and columns in the dataframe
- Show the data types of the columns in the dataframe

In [13]:
#Read the Excel file into a dataframd and display the top rows of the dataframe

df_order_details = pd.read_excel("Data/w3schools_Data.xlsx", "OrderDetails")

df_order_details.head()

   OrderDetailID  OrderID  ProductID  Quantity
0              1    10248         11        12
1              2    10248         42        10
2              3    10248         72         5
3              4    10249         14         9
4              5    10249         51        40

In [14]:
#Dislay the number of rows and columns in the dataframe
print("The Number of Rows: ", df_order_details.shape[0])
print("The Number of Columns: ", df_order_details.shape[1])

The Number of Rows:  518
The Number of Columns:  4

In [15]:
#Show the datatypes of the columns in the dataframe
df_order_details.dtypes

OrderDetailID    int64
OrderID          int64
ProductID        int64
Quantity         int64
dtype: object

# Part 4: w3schools - Employees worksheet
- Excel Filename:  **w3schools_Data.xlsx** 
- Worksheet: **Employees**  
- pandas Dataframe name: **df_w3_employees** 


- Display the top rows of the dataframe   
- Display the number of rows and columns in the dataframe
- Show the data types of the columns in the dataframe

In [17]:
#Read the Excel file into a dataframd and display the top rows of the dataframe

df_w3_employees = pd.read_excel("Data/w3schools_Data.xlsx", "Employees", skiprows=2)

df_w3_employees.head()

,EmployeeID,LastName,FirstName,BirthDate,Photo,Notes
0,1,Davolio,Nancy,25180,EmpID1.pic,Education includes a BA in psychology from Col...
1,2,Fuller,Andrew,19043,EmpID2.pic,Andrew received his BTS commercial and a Ph.D....
2,3,Leverling,Janet,23253,EmpID3.pic,Janet has a BS degree in chemistry from Boston...
3,4,Peacock,Margaret,21447,EmpID4.pic,Margaret holds a BA in English literature from...
4,5,Buchanan,Steven,20152,EmpID5.pic,Steven Buchanan graduated from St. Andrews Uni...

In [18]:
#Dislay the number of rows and columns in the dataframe
print("The Number of Rows: ", df_w3_employees.shape[0])
print("The Number of Columns: ", df_w3_employees.shape[1])

The Number of Rows:  10
The Number of Columns:  6

In [20]:
#Show the datatypes of the columns in the dataframe
df_w3_employees.dtypes

EmployeeID     int64
LastName      object
FirstName     object
BirthDate      int64
Photo         object
Notes         object
dtype: object